lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/LowPower/ZigbeeSleepyOnOffButton/ZigbeeSleepyOnOffButton.ino
#include <Arduino.h>
#include <string.h>

#include "nrf54l15_hal.h"
#include "zigbee_commissioning.h"
#include "zigbee_persistence.h"
#include "zigbee_frame_counter.h"
#include "zigbee_security.h"
#include "zigbee_stack.h"

#if defined(NRF54L15_CLEAN_ZIGBEE_ENABLED) && (NRF54L15_CLEAN_ZIGBEE_ENABLED == 0)
#error "Enable Tools > Zigbee Support to build ZigbeeSleepyOnOffButton."
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_CHANNEL
#define NRF54L15_CLEAN_ZIGBEE_CHANNEL 15
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PAN_ID
#define NRF54L15_CLEAN_ZIGBEE_PAN_ID 0x1234
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PRIMARY_CHANNEL_MASK
#define NRF54L15_CLEAN_ZIGBEE_PRIMARY_CHANNEL_MASK 0x07FFF800UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_SECONDARY_CHANNEL_MASK
#define NRF54L15_CLEAN_ZIGBEE_SECONDARY_CHANNEL_MASK 0U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ACTIVE_SCAN_WINDOW_MS
#define NRF54L15_CLEAN_ZIGBEE_ACTIVE_SCAN_WINDOW_MS 400UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_RESPONSE_TIMEOUT_MS
#define NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_RESPONSE_TIMEOUT_MS 4000UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_POLL_LISTEN_MS
#define NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_POLL_LISTEN_MS 120UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_POLL_RETRY_DELAY_MS
#define NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_POLL_RETRY_DELAY_MS 40UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US
#define NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US 80000UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_COORDINATOR_REALIGNMENT_TIMEOUT_MS
#define NRF54L15_CLEAN_ZIGBEE_COORDINATOR_REALIGNMENT_TIMEOUT_MS 400UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_NWK_REJOIN_RESPONSE_TIMEOUT_MS
#define NRF54L15_CLEAN_ZIGBEE_NWK_REJOIN_RESPONSE_TIMEOUT_MS 1500UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE
#define NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY
#define NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_REQUIRE_ENCRYPTED_TRANSPORT_KEY
#define NRF54L15_CLEAN_ZIGBEE_REQUIRE_ENCRYPTED_TRANSPORT_KEY 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS
#define NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS 0
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_TRUST_CENTER_IEEE
#define NRF54L15_CLEAN_ZIGBEE_TRUST_CENTER_IEEE 0ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PREFERRED_EXTENDED_PAN_ID
#define NRF54L15_CLEAN_ZIGBEE_PREFERRED_EXTENDED_PAN_ID 0ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_COORDINATOR_SHORT
#define NRF54L15_CLEAN_ZIGBEE_COORDINATOR_SHORT 0x0000U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_LOCAL_SHORT
#define NRF54L15_CLEAN_ZIGBEE_LOCAL_SHORT 0x7E11U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_LOCAL_IEEE
#define NRF54L15_CLEAN_ZIGBEE_LOCAL_IEEE 0ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_INSTALL_CODE_BYTES                                  \
  0x10U, 0xACU, 0x51U, 0x01U, 0x24U, 0x4BU, 0x00U, 0x57U, 0x68U, 0x79U, 0x8AU, \
      0x9BU, 0xACU, 0xBDU, 0xCEU, 0xDFU, 0x1FU, 0x7FU
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BASIC_MANUFACTURER_NAME
#define NRF54L15_CLEAN_ZIGBEE_BASIC_MANUFACTURER_NAME "CleanCore"
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BASIC_MODEL_IDENTIFIER
#define NRF54L15_CLEAN_ZIGBEE_BASIC_MODEL_IDENTIFIER "X54-BUTTON-REMOTE"
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BASIC_SW_BUILD_ID
#define NRF54L15_CLEAN_ZIGBEE_BASIC_SW_BUILD_ID "0.3.8"
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BUTTON_PAIR_HOLD_MS
#define NRF54L15_CLEAN_ZIGBEE_BUTTON_PAIR_HOLD_MS 3000UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BUTTON_DEBOUNCE_MS
#define NRF54L15_CLEAN_ZIGBEE_BUTTON_DEBOUNCE_MS 35UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PAIRING_WINDOW_MS
#define NRF54L15_CLEAN_ZIGBEE_PAIRING_WINDOW_MS 90000UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BATTERY_REPORT_MIN_S
#define NRF54L15_CLEAN_ZIGBEE_BATTERY_REPORT_MIN_S 5U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BATTERY_REPORT_MAX_S
#define NRF54L15_CLEAN_ZIGBEE_BATTERY_REPORT_MAX_S 21600U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BATTERY_VOLTAGE_REPORT_CHANGE
#define NRF54L15_CLEAN_ZIGBEE_BATTERY_VOLTAGE_REPORT_CHANGE 1U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BATTERY_PERCENT_REPORT_CHANGE
#define NRF54L15_CLEAN_ZIGBEE_BATTERY_PERCENT_REPORT_CHANGE 2U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ONOFF_REPORT_MIN_S
#define NRF54L15_CLEAN_ZIGBEE_ONOFF_REPORT_MIN_S 0U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ONOFF_REPORT_MAX_S
#define NRF54L15_CLEAN_ZIGBEE_ONOFF_REPORT_MAX_S 3600U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ONOFF_REPORT_CHANGE
#define NRF54L15_CLEAN_ZIGBEE_ONOFF_REPORT_CHANGE 1U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ACTION_AWAKE_WINDOW_MS
#define NRF54L15_CLEAN_ZIGBEE_ACTION_AWAKE_WINDOW_MS 6000UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_COMMISSIONING_AWAKE_MS
#define NRF54L15_CLEAN_ZIGBEE_COMMISSIONING_AWAKE_MS 180000UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BOOT_AWAKE_WINDOW_MS
#define NRF54L15_CLEAN_ZIGBEE_BOOT_AWAKE_WINDOW_MS 12000UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_STATUS_INTERVAL_MS
#define NRF54L15_CLEAN_ZIGBEE_STATUS_INTERVAL_MS 1000UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_BOOT_REPORT_DELAY_MS
#define NRF54L15_CLEAN_ZIGBEE_BOOT_REPORT_DELAY_MS 1200UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_INTERVIEW_GRACE_MS
#define NRF54L15_CLEAN_ZIGBEE_INTERVIEW_GRACE_MS 45000UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_SYSTEM_OFF_ENTRY_DELAY_MS
#define NRF54L15_CLEAN_ZIGBEE_SYSTEM_OFF_ENTRY_DELAY_MS 350UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_DEBUG_KEEP_AWAKE
#define NRF54L15_CLEAN_ZIGBEE_DEBUG_KEEP_AWAKE 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_DIRECT_LOOKUP_TIMEOUT_MS
#define NRF54L15_CLEAN_ZIGBEE_DIRECT_LOOKUP_TIMEOUT_MS 1000UL
#endif

using namespace xiao_nrf54l15;

namespace {

static PowerManager g_powerManager;
static ZigbeeRadio g_radio;
static ZigbeeHomeAutomationDevice g_device;
static ZigbeePersistentStateStore g_store;
static ZigbeeOutgoingFrameCounterAllocator g_outgoingFrameCounters;
static bool g_persistentSecurityReady = false;
static bool g_radioReady = false;

static uint8_t g_macSequence = 1U;
static ZigbeeEndDeviceCommonState g_network{};
static uint8_t& g_nwkSequence = g_network.nwkSequence;
static uint32_t& g_lastInboundSecurityFrameCounter =
    g_network.incomingNwkFrameCounter;
static uint32_t& g_lastInboundApsFrameCounter =
    g_network.incomingApsFrameCounter;
static uint8_t& g_apsCounter = g_network.apsCounter;
static uint8_t g_zdoSequence = 1U;
static uint32_t& g_lastJoinAttemptMs = g_network.lastJoinAttemptMs;
static uint32_t g_lastStatusMs = 0U;
static uint32_t g_lastPollMs = 0U;
static uint32_t g_bootMs = 0U;
static uint32_t g_awakeUntilMs = 0U;
static uint32_t g_pairingWindowUntilMs = 0U;
static bool g_pendingButtonAction = false;
static bool g_wokeFromButton = false;
static uint8_t (&g_activeNetworkKey)[16] = g_network.activeNetworkKey;
static uint8_t& g_activeNetworkKeySequence = g_network.activeNetworkKeySequence;
static uint8_t (&g_alternateNetworkKey)[16] = g_network.alternateNetworkKey;
static uint8_t& g_alternateNetworkKeySequence =
    g_network.alternateNetworkKeySequence;
static bool& g_joined = g_network.joined;
static bool& g_rejoinPending = g_network.rejoinPending;
static bool& g_securityEnabled = g_network.securityEnabled;
static bool& g_haveActiveNetworkKey = g_network.haveActiveNetworkKey;
static bool& g_haveAlternateNetworkKey = g_network.haveAlternateNetworkKey;
static uint64_t& g_trustCenterIeee = g_network.trustCenterIeee;
static ZigbeePreconfiguredKeyMode& g_preconfiguredKeyMode =
    g_network.preconfiguredKeyMode;
static uint32_t& g_parentPollIntervalMs = g_network.parentPollIntervalMs;

static ZigbeePersistentState g_restoredState{};
static bool g_haveRestoredState = false;
static bool g_bootReportsPending = true;

static constexpr uint8_t kPreferredChannel =
    static_cast<uint8_t>(NRF54L15_CLEAN_ZIGBEE_CHANNEL);
static constexpr uint16_t kPreferredPanId =
    static_cast<uint16_t>(NRF54L15_CLEAN_ZIGBEE_PAN_ID);
static constexpr uint16_t kCoordinatorShort =
    static_cast<uint16_t>(NRF54L15_CLEAN_ZIGBEE_COORDINATOR_SHORT);
static constexpr uint16_t kButtonShort =
    static_cast<uint16_t>(NRF54L15_CLEAN_ZIGBEE_LOCAL_SHORT);
static constexpr uint8_t kLocalEndpoint = 1U;
static constexpr uint8_t kCoordinatorEndpoint = 1U;
static constexpr uint8_t kOnOffCommandOff = 0x00U;
static constexpr uint8_t kOnOffCommandOn = 0x01U;
static constexpr uint8_t kOnOffCommandToggle = 0x02U;
static constexpr uint8_t kSystemOffMagic = 0xB7U;
static constexpr uint64_t kConfiguredPreferredExtendedPanId =
    static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_PREFERRED_EXTENDED_PAN_ID);
static uint64_t g_localIeee =
    static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_LOCAL_IEEE);
static uint64_t& kIeeeAddress = g_localIeee;
static constexpr uint8_t kStateFlagJoined = 0x01U;
static constexpr uint8_t kStateFlagSecurityEnabled = 0x02U;
static const uint8_t kInstallCode[18] = {
    NRF54L15_CLEAN_ZIGBEE_INSTALL_CODE_BYTES};

static uint8_t& g_channel = g_network.channel;
static uint16_t& g_panId = g_network.panId;
static uint16_t& g_localShort = g_network.localShort;
static uint16_t& g_parentShort = g_network.parentShort;
static uint64_t& g_extendedPanId = g_network.extendedPanId;

struct ScanResult {
  bool valid = false;
  uint8_t channel = 0U;
  int8_t rssiDbm = -127;
  int16_t score = 0;
  ZigbeeMacBeaconView beacon{};
};

