lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/LowPower/ZigbeeSleepyOnOffButton/ZigbeeSleepyOnOffButton.ino
void applyBindingState() {
  if (!g_haveRestoredState || g_restoredState.bindingCount == 0U) {
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.bindingCount && i < 8U; ++i) {
    if (!g_restoredState.bindings[i].used) {
      continue;
    }
    (void)g_device.addBinding(g_restoredState.bindings[i].sourceEndpoint,
                              g_restoredState.bindings[i].clusterId,
                              g_restoredState.bindings[i].destinationAddressMode,
                              g_restoredState.bindings[i].destinationGroup,
                              g_restoredState.bindings[i].destinationIeee,
                              g_restoredState.bindings[i].destinationEndpoint);
  }
}

void sampleSensors() {
  int32_t vbatMv = 0;
  uint8_t vbatPercent = 0;
  if (BoardControl::sampleBatteryMilliVolts(&vbatMv) &&
      BoardControl::sampleBatteryPercent(&vbatPercent)) {
    const uint8_t decivolts =
        static_cast<uint8_t>(vbatMv <= 0 ? 0 : (vbatMv / 100));
    const uint8_t halfPercent =
        static_cast<uint8_t>(vbatPercent >= 100U ? 200U : vbatPercent * 2U);
    g_device.setBatteryStatus(decivolts, halfPercent);
  }
}

static bool identifyIndicatorOn(uint32_t nowMs, uint8_t effectIdentifier) {
  switch (effectIdentifier) {
    case kZigbeeIdentifyEffectBlink:
    case kZigbeeIdentifyEffectOkay:
      return ((nowMs / 150U) & 0x01UL) == 0U;
    case kZigbeeIdentifyEffectBreathe:
      return ((nowMs % 1200U) < 800U);
    case kZigbeeIdentifyEffectChannelChange:
      return ((nowMs / 75U) & 0x01UL) == 0U;
    case kZigbeeIdentifyEffectFinishEffect:
      return true;
    default:
      return ((nowMs / 250U) & 0x01UL) == 0U;
  }
}

void applyJoinLed() {
  const uint32_t nowMs = millis();
  g_device.updateIdentify(nowMs);
  const bool pairingBlink =
      !g_joined && static_cast<int32_t>(g_pairingWindowUntilMs - nowMs) > 0;
  const bool ledOn = g_device.identifying()
                         ? identifyIndicatorOn(nowMs, g_device.identifyEffect())
                         : (pairingBlink ? (((nowMs / 120U) & 0x01UL) == 0U)
                                         : g_joined);
  Gpio::write(kPinUserLed, !ledOn);
}

[[maybe_unused]] void clearActiveNetworkKey() {
  memset(g_activeNetworkKey, 0, sizeof(g_activeNetworkKey));
  g_activeNetworkKeySequence = 0U;
  g_haveActiveNetworkKey = false;
}

uint8_t readGpregret0() {
  return static_cast<uint8_t>(NRF_POWER->GPREGRET[0] &
                              POWER_GPREGRET_GPREGRET_Msk);
}

void writeGpregret0(uint8_t value) {
  NRF_POWER->GPREGRET[0] = static_cast<uint32_t>(value);
}

bool buttonPressed() {
  bool high = true;
  if (!Gpio::read(kPinUserButton, &high)) {
    return false;
  }
  return !high;
}

void configureButtonSenseLowWake() {
  (void)Gpio::configure(kPinUserButton, GpioDirection::kInput,
                        GpioPull::kDisabled);
  if (kPinUserButton.port != 0U) {
    return;
  }

  uint32_t cnf = NRF_P0->PIN_CNF[kPinUserButton.pin];
  cnf &= ~GPIO_PIN_CNF_SENSE_Msk;
  cnf |= (GPIO_PIN_CNF_SENSE_Low << GPIO_PIN_CNF_SENSE_Pos);
  NRF_P0->PIN_CNF[kPinUserButton.pin] = cnf;
}

uint32_t measureButtonHoldMs(uint32_t thresholdMs) {
  if (!buttonPressed()) {
    return 0U;
  }

  const uint32_t startMs = millis();
  while (buttonPressed()) {
    const uint32_t heldMs = millis() - startMs;
    if (heldMs >= thresholdMs) {
      return heldMs;
    }
    delay(10);
  }
  return millis() - startMs;
}

void extendAwakeWindow(uint32_t durationMs) {
  const uint32_t targetMs = millis() + durationMs;
  if (static_cast<int32_t>(targetMs - g_awakeUntilMs) > 0) {
    g_awakeUntilMs = targetMs;
  }
}

void beginPairingWindow(bool factoryResetFirst) {
  if (factoryResetFirst) {
    clearJoinState(true);
  }
  g_pairingWindowUntilMs = millis() +
                           static_cast<uint32_t>(
                               NRF54L15_CLEAN_ZIGBEE_PAIRING_WINDOW_MS);
  extendAwakeWindow(static_cast<uint32_t>(
      NRF54L15_CLEAN_ZIGBEE_PAIRING_WINDOW_MS));
  if (!g_joined && !g_rejoinPending) {
    ZigbeeCommissioning::requestNetworkSteering(&g_network);
  }
}

void enterSystemOffIfPossible() {
#if NRF54L15_CLEAN_ZIGBEE_DEBUG_KEEP_AWAKE
  return;
#endif
  if (!lowPowerCycleEnabled() || hasPendingApsAcks() || g_device.identifying()) {
    return;
  }
  if (static_cast<int32_t>(g_awakeUntilMs - millis()) > 0) {
    return;
  }
  if (!g_joined && static_cast<int32_t>(g_pairingWindowUntilMs - millis()) > 0) {
    return;
  }

  Serial.print("system_off wait_button\r\n");
  Serial.flush();
  delay(20);
  configureButtonSenseLowWake();
  writeGpregret0(kSystemOffMagic);
  g_powerManager.systemOffNoRetention();
}

void configureDeviceForCurrentNetwork() {
  ZigbeeBasicClusterConfig basic{};
  basic.manufacturerName = NRF54L15_CLEAN_ZIGBEE_BASIC_MANUFACTURER_NAME;
  basic.modelIdentifier = NRF54L15_CLEAN_ZIGBEE_BASIC_MODEL_IDENTIFIER;
  basic.swBuildId = NRF54L15_CLEAN_ZIGBEE_BASIC_SW_BUILD_ID;
  basic.powerSource = 0x03U;
  g_device.configureOnOffLightSwitch(kLocalEndpoint, kIeeeAddress, g_localShort,
                                     g_panId, basic, 0x0000U);
  applyReportingState();
  applyBindingState();
  sampleSensors();
}

bool persistState() {
  refreshCommissioningState();
  ZigbeePersistentState state{};
  ZigbeeCommissioning::populatePersistentState(
      g_network, kIeeeAddress, ZigbeeLogicalType::kEndDevice,
      g_device.config().manufacturerCode, &state);

  const ZigbeeReportingConfiguration* reporting = g_device.reportingConfigurations();
  uint8_t copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!reporting[i].used) {
      continue;
    }
    state.reporting[copied++] = reporting[i];
  }
  state.reportingCount = copied;
  const ZigbeeBindingEntry* bindings = g_device.bindings();
  copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!bindings[i].used) {
      continue;
    }
    state.bindings[copied++] = bindings[i];
  }
  state.bindingCount = copied;
  g_outgoingFrameCounters.stampPersistentState(&state);
  const bool saved = g_store.save(state);
  if (!saved) {
    g_persistentSecurityReady = false;
    g_outgoingFrameCounters.disable(ZigbeeOutgoingCounterDomain::kNwk);
    g_outgoingFrameCounters.disable(
        ZigbeeOutgoingCounterDomain::kApsTrustCenter);
    g_outgoingFrameCounters.disable(
        ZigbeeOutgoingCounterDomain::kApsTrustCenter);
  }
  return saved;
}

void restoreState() {
  g_restoredState = ZigbeePersistentState{};
  g_persistentSecurityReady = false;
  g_haveRestoredState = false;
  ZigbeeCommissioning::initializeEndDeviceState(&g_network,
                                                commissioningPolicy(),
                                                kPreferredChannel,
                                                kPreferredPanId, kButtonShort,
                                                kCoordinatorShort);

