lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/LowPower/ZigbeeSleepyOnOffButton/ZigbeeSleepyOnOffButton.ino
  (void)g_device.commitDueAttributeReport(nowMs);
  if (outClusterId != nullptr) {
    *outClusterId = clusterId;
  }
  return true;
}

bool triggerButtonAction(uint8_t commandId) {
  if (!g_joined) {
    return false;
  }

  bool targetOn = g_device.onOff();
  if (commandId == kOnOffCommandOn) {
    targetOn = true;
  } else if (commandId == kOnOffCommandOff) {
    targetOn = false;
  } else {
    targetOn = !targetOn;
  }

  (void)g_device.setOnOff(targetOn);
  sampleSensors();
  const bool commandOk = sendButtonOnOffCommand(commandId);
  const bool powerOk = sendAttributeReport(kZigbeeClusterPowerConfiguration);
  if (!persistState()) {
    return false;
  }
  extendAwakeWindow(
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_ACTION_AWAKE_WINDOW_MS));
  Serial.print("button_action cmd=");
  if (commandId == kOnOffCommandOn) {
    Serial.print("on");
  } else if (commandId == kOnOffCommandOff) {
    Serial.print("off");
  } else {
    Serial.print("toggle");
  }
  Serial.print(" local_onoff=");
  Serial.print(targetOn ? "on" : "off");
  Serial.print(" zcl_cmd=");
  Serial.print(commandOk ? "OK" : "FAIL");
  Serial.print(" power_report=");
  Serial.print(powerOk ? "OK" : "FAIL");
  Serial.print("\r\n");
  return commandOk || powerOk;
}

bool handleApsCommand(const uint8_t* frame, uint8_t length, uint16_t sourceShort,
                      uint64_t securedSourceIeee, bool nwkSecured) {
  refreshCommissioningState();

  uint8_t installCodeKey[16] = {0U};
  const bool haveInstallCodeKey = loadInstallCodeLinkKey(installCodeKey);
  ZigbeeTransportKeyInstallResult transportInstall{};
  if (ZigbeeCommissioning::acceptTransportKeyCommand(
          g_network, kIeeeAddress, sourceShort, securedSourceIeee, nwkSecured,
          frame, length, installCodeKey,
          haveInstallCodeKey, &transportInstall)) {
    ZigbeeCommissioning::applyTransportKeyInstall(&g_network, transportInstall);
    if (transportInstall.activatesNetworkKey) {
      g_outgoingFrameCounters.resetForNewKey(
          ZigbeeOutgoingCounterDomain::kNwk);
    }
    if (transportInstall.activatesNetworkKey) {
      g_lastInboundSecurityFrameCounter = 0U;
    }
    if (!persistState()) {
      return false;
    }
    if (transportInstall.stagesAlternateKey) {
      Serial.print("transport_key_update seq=");
    } else if (transportInstall.refreshesAlternateKey) {
      Serial.print("transport_key_update_refresh seq=");
    } else {
      Serial.print("transport_key seq=");
    }
    Serial.print(transportInstall.transportKey.keySequence);
    Serial.print(" install=");
    if (transportInstall.activatesNetworkKey) {
      Serial.print("active");
    } else if (transportInstall.stagesAlternateKey) {
      Serial.print("staged");
    } else if (transportInstall.refreshesActiveNetworkKey) {
      Serial.print("active_refresh");
    } else if (transportInstall.refreshesAlternateKey) {
      Serial.print("staged_refresh");
    } else {
      Serial.print("noop");
    }
    Serial.print(" tc=0x");
    Serial.print(static_cast<uint32_t>(g_trustCenterIeee >> 32U), HEX);
    Serial.print(static_cast<uint32_t>(g_trustCenterIeee & 0xFFFFFFFFUL), HEX);
    Serial.print(" lk=");
    Serial.print(ZigbeeCommissioning::keyModeName(g_preconfiguredKeyMode));
    Serial.print(" ctr=");
    Serial.print(transportInstall.counter);
    if (transportInstall.apsSecurity.valid) {
      Serial.print(" aps_sec_fc=");
      Serial.print(transportInstall.apsSecurity.frameCounter);
    }
    Serial.print("\r\n");
    extendAwakeWindow(static_cast<uint32_t>(
        NRF54L15_CLEAN_ZIGBEE_COMMISSIONING_AWAKE_MS));
    return true;
  }

  ZigbeeUpdateDeviceAcceptance updateDevice{};
  if (ZigbeeCommissioning::acceptUpdateDeviceCommand(
          g_network, kIeeeAddress, sourceShort, securedSourceIeee, nwkSecured,
#if NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS
          true,
#else
          false,
#endif
          frame, length, installCodeKey, haveInstallCodeKey, &updateDevice)) {
    ZigbeeCommissioning::applyUpdateDevice(&g_network, updateDevice);
    if (updateDevice.updateDevice.status ==
        kZigbeeApsUpdateDeviceStatusStandardSecureRejoin) {
      configureDeviceForCurrentNetwork();
      applyJoinLed();
    }
    if (!persistState()) {
      return false;
    }
    Serial.print("update_device short=0x");
    Serial.print(updateDevice.updateDevice.deviceShort, HEX);
    Serial.print(" status=0x");
    Serial.print(updateDevice.updateDevice.status, HEX);
    Serial.print(" nwk_sec=");
    Serial.print(nwkSecured ? "1" : "0");
    if (updateDevice.apsSecurity.valid) {
      Serial.print(" aps_sec_fc=");
      Serial.print(updateDevice.apsSecurity.frameCounter);
    }
    Serial.print("\r\n");
    extendAwakeWindow(static_cast<uint32_t>(
        NRF54L15_CLEAN_ZIGBEE_COMMISSIONING_AWAKE_MS));
    return true;
  }

  ZigbeeSwitchKeyAcceptance switchKey{};
  if (ZigbeeCommissioning::acceptSwitchKeyCommand(
          g_network, sourceShort, securedSourceIeee, nwkSecured, false, frame,
          length, installCodeKey, haveInstallCodeKey, &switchKey)) {
    ZigbeeCommissioning::applySwitchKey(&g_network, switchKey);
    g_outgoingFrameCounters.resetForNewKey(
        ZigbeeOutgoingCounterDomain::kNwk);
    g_lastInboundSecurityFrameCounter = 0U;
    configureDeviceForCurrentNetwork();
    applyJoinLed();
    if (!persistState()) {
      return false;
    }
    Serial.print("switch_key seq=");
    Serial.print(g_activeNetworkKeySequence);
    Serial.print(" ctr=");
    Serial.print(switchKey.counter);
    if (switchKey.apsSecurity.valid) {
      Serial.print(" aps_sec_fc=");
      Serial.print(switchKey.apsSecurity.frameCounter);
    }
    Serial.print("\r\n");
    extendAwakeWindow(static_cast<uint32_t>(
        NRF54L15_CLEAN_ZIGBEE_COMMISSIONING_AWAKE_MS));
    return true;
  }

  const ZigbeeCommissioningFailure rejectedFailure =
      ZigbeeCommissioning::classifyRejectedTrustCenterCommand(
          g_network, frame, length, installCodeKey, haveInstallCodeKey);
  if (rejectedFailure != ZigbeeCommissioningFailure::kNone) {
    g_network.lastFailure = rejectedFailure;
    Serial.print("tc_cmd reject=");
    Serial.print(ZigbeeCommissioning::failureName(rejectedFailure));
    Serial.print(" mode=");
    Serial.print(ZigbeeCommissioning::stateName(g_network.state));
    Serial.print("\r\n");
    return true;
  }

