lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/LowPower/ZigbeeSleepyOnOffButton/ZigbeeSleepyOnOffButton.ino
  if (aps.profileId == kZigbeeProfileZdo) {
    Serial.print("zdo_req cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" len=");
    Serial.print(aps.payloadLength);
    Serial.print(" ack=");
    Serial.print(aps.ackRequested ? "yes" : "no");
    Serial.print(" dup=");
    Serial.print(duplicateAps ? "yes" : "no");
    Serial.print("\r\n");
    if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
      delayMicroseconds(kParentRxAcknowledgeDelayUs);
      (void)sendApsAcknowledgement(nwk.sourceShort, aps);
    }
    if (duplicateAps) {
      Serial.print("aps_dup cluster=0x");
      Serial.print(aps.clusterId, HEX);
      Serial.print(" src=0x");
      Serial.print(nwk.sourceShort, HEX);
      Serial.print(" replay=yes\r\n");
    } else {
      rememberRecentInboundAps(nwk.sourceShort, aps);
    }
    uint16_t responseClusterId = 0U;
    uint8_t responsePayload[127] = {0U};
    uint8_t responseLength = 0U;
    if (g_device.handleZdoRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                  &responseClusterId, responsePayload,
                                  &responseLength) &&
        responseLength > 0U) {
      delayMicroseconds(kParentRxResponseDelayUs);
      const bool sent = sendApsFrame(nwk.sourceShort, 0U, responseClusterId,
                                     kZigbeeProfileZdo, 0U, responsePayload,
                                     responseLength);
      Serial.print("zdo_rsp cluster=0x");
      Serial.print(responseClusterId, HEX);
      Serial.print(" len=");
      Serial.print(responseLength);
      Serial.print(" sent=");
      Serial.print(sent ? "yes" : "no");
      Serial.print("\r\n");
      uint8_t leaveFlags = 0U;
      if (g_device.consumeLeaveRequest(&leaveFlags)) {
        handleAcceptedLeaveRequest(leaveFlags);
      }
    }
    return;
  }

  if (aps.profileId != kZigbeeProfileHomeAutomation ||
      aps.destinationEndpoint != kLocalEndpoint) {
    return;
  }
  if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
    delayMicroseconds(kParentRxAcknowledgeDelayUs);
    (void)sendApsAcknowledgement(nwk.sourceShort, aps);
  }
  if (duplicateAps) {
    Serial.print("aps_dup cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" src=0x");
    Serial.print(nwk.sourceShort, HEX);
    Serial.print(" replay=yes\r\n");
  } else {
    rememberRecentInboundAps(nwk.sourceShort, aps);
  }

  uint8_t responseFrame[127] = {0U};
  uint8_t responseLength = 0U;
  if (!g_device.handleZclRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                 responseFrame, &responseLength)) {
    return;
  }

  persistState();
  Serial.print("zcl cluster=0x");
  Serial.print(aps.clusterId, HEX);
  Serial.print("\r\n");
  if (responseLength > 0U) {
    delayMicroseconds(kParentRxResponseDelayUs);
    (void)sendApsFrame(nwk.sourceShort, aps.sourceEndpoint, aps.clusterId,
                       aps.profileId, aps.destinationEndpoint, responseFrame,
                       responseLength);
  }
}

void pollCoordinator() {
  refreshCommissioningState();
  if (!ZigbeeCommissioning::shouldPollParent(g_network)) {
    return;
  }

  uint8_t request[127] = {0U};
  uint8_t requestLength = 0U;
  const bool joinedPoll =
      ZigbeeCommissioning::selectShortSourceParentPoll(&g_network);
  const bool built =
      joinedPoll
          ? ZigbeeCodec::buildDataRequestShort(g_macSequence++, g_panId,
                                               g_parentShort, g_localShort,
                                               request, &requestLength)
          : ZigbeeCodec::buildDataRequest(g_macSequence++, g_panId,
                                          g_parentShort, kIeeeAddress, request,
                                          &requestLength);
  if (!built) {
    return;
  }
  ZigbeeFrame frame{};
  if (g_radio.transmitThenReceive(request, requestLength, &frame, 12000U, false,
                                  1200000UL)) {
    processIncomingFrame(frame);
  }

  const uint32_t followupWindowStartUs = micros();
  while (static_cast<uint32_t>(micros() - followupWindowStartUs) <
         static_cast<uint32_t>(
             NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US)) {
    const uint32_t elapsedUs =
        static_cast<uint32_t>(micros() - followupWindowStartUs);
    const uint32_t remainingUs =
        (elapsedUs <
         static_cast<uint32_t>(
             NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US))
            ? (static_cast<uint32_t>(
                   NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US) -
               elapsedUs)
            : 0U;
    if (remainingUs == 0U) {
      break;
    }
    if (!g_radio.receive(&frame, remainingUs, 350000UL)) {
      continue;
    }
    processIncomingFrame(frame);
  }
}

void maybeSendScheduledReports(uint32_t nowMs) {
  if (!g_joined || inInterviewGracePeriod(nowMs)) {
    return;
  }

  while (sendDueAttributeReport(nowMs, nullptr)) {
  }
}

bool inInterviewGracePeriod(uint32_t nowMs) {
  return g_joined && g_lastJoinAttemptMs != 0U &&
         (nowMs - g_lastJoinAttemptMs) <
             static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_INTERVIEW_GRACE_MS);
}

void maybeSendBootReports(uint32_t nowMs) {
  if (!g_joined || !g_bootReportsPending) {
    return;
  }
  if (inInterviewGracePeriod(nowMs)) {
    return;
  }
  if ((nowMs - g_bootMs) <
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_BOOT_REPORT_DELAY_MS)) {
    return;
  }

  const bool onOffOk = sendAttributeReport(kZigbeeClusterOnOff);
  const bool powerOk = sendAttributeReport(kZigbeeClusterPowerConfiguration);
  g_bootReportsPending = false;
  Serial.print("boot_report onoff=");
  Serial.print(onOffOk ? "OK" : "FAIL");
  Serial.print(" power=");
  Serial.print(powerOk ? "OK" : "FAIL");
  Serial.print("\r\n");
}

void maybeEnterLowPowerCycle(uint32_t nowMs) {
  (void)nowMs;
  enterSystemOffIfPossible();
}

void debugListenCurrentChannel(uint32_t durationMs) {
  const uint32_t deadline = millis() + durationMs;
  Serial.print("listen ch=");
  Serial.print(g_channel);
  Serial.print(" ms=");
  Serial.print(durationMs);
  Serial.print("\r\n");
  while (static_cast<int32_t>(millis() - deadline) < 0) {
    ZigbeeFrame frame{};
    if (!g_radio.receive(&frame, 10000U, 400000UL)) {
      continue;
    }
    Serial.print("listen_rx len=");
    Serial.print(frame.length);
    Serial.print(" rssi=");
    Serial.print(frame.rssiDbm);
    ZigbeeMacBeaconView beacon{};
    if (ZigbeeCodec::parseBeaconFrame(frame.psdu, frame.length, &beacon) &&
        beacon.valid) {
      Serial.print(" beacon pan=0x");
      Serial.print(beacon.panId, HEX);
      Serial.print(" parent=0x");
      Serial.print(beacon.sourceShort, HEX);
      Serial.print(" permit=");
      Serial.print(beacon.associationPermit ? "yes" : "no");
    }
    Serial.print("\r\n");
  }
  Serial.print("listen done\r\n");
}

void handleSerialCommands() {
  while (Serial.available() > 0) {
    const int ch = Serial.read();
    if ((!g_persistentSecurityReady || !g_radioReady) && ch != 'c' &&
        ch != 's') {
      if (ch != '\r' && ch != '\n') {
        Serial.print("persistence blocked; use c to clear or s for status\r\n");
      }
      continue;
    }
    extendAwakeWindow(static_cast<uint32_t>(
        NRF54L15_CLEAN_ZIGBEE_ACTION_AWAKE_WINDOW_MS));
    if (ch == 'r') {
      const bool powerOk = sendAttributeReport(kZigbeeClusterPowerConfiguration);
      Serial.print("report power=");
      Serial.print(powerOk ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 't') {
      g_pendingButtonAction = true;
      extendAwakeWindow(
          static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_ACTION_AWAKE_WINDOW_MS));
      Serial.print("toggle requested\r\n");
    } else if (ch == 'o') {
      (void)triggerButtonAction(kOnOffCommandOn);
    } else if (ch == 'f') {
      (void)triggerButtonAction(kOnOffCommandOff);
    } else if (ch == 'j') {
      beginPairingWindow(false);
      Serial.print("pairing window opened\r\n");
    } else if (ch == 'b') {
      ScanResult scan{};
      if (activeScan(&scan) && scan.valid) {
        Serial.print("scan_candidate ch=");
        Serial.print(scan.channel);
        Serial.print(" pan=0x");
        Serial.print(scan.beacon.panId, HEX);
        Serial.print(" parent=0x");
        Serial.print(scan.beacon.sourceShort, HEX);
        Serial.print(" rssi=");
        Serial.print(scan.rssiDbm);
        Serial.print(" permit=");
        Serial.print(scan.beacon.associationPermit ? "yes" : "no");
        Serial.print("\r\n");
      } else {
        Serial.print("scan_candidate none failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
      }
    } else if (ch == 'y') {
      debugListenCurrentChannel(500U);
    } else if (ch == 'c') {
      const bool cleared = clearJoinState(true);
      Serial.print(cleared ? "state cleared\r\n"
                           : "state clear failed\r\n");
    } else if (ch == 'p') {
      beginPairingWindow(true);
      Serial.print("factory reset + pairing window\r\n");
    } else if (ch == 's') {
      Serial.print("state joined=");
      Serial.print(g_joined ? "yes" : "no");
      Serial.print(" mode=");
      Serial.print(ZigbeeCommissioning::stateName(g_network.state));
      Serial.print(" failure=");
      Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
      Serial.print(" join_attempts=");
      Serial.print(g_network.joinAttempts);
      Serial.print(" rejoin_attempts=");
      Serial.print(g_network.rejoinAttempts);
      Serial.print(" ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print(" nwk_seq=");
      Serial.print(g_haveActiveNetworkKey ? g_activeNetworkKeySequence : 0U);
      Serial.print(" alt_seq=");
      Serial.print(g_haveAlternateNetworkKey ? g_alternateNetworkKeySequence
                                             : 0U);
      Serial.print(" poll_ms=");
      Serial.print(g_parentPollIntervalMs);
      Serial.print(" onoff=");
      Serial.print(g_device.onOff() ? "on" : "off");
      Serial.print(" pair_ms_left=");
      const uint32_t nowMs = millis();
      const uint32_t pairRemaining =
          static_cast<int32_t>(g_pairingWindowUntilMs - nowMs) > 0
              ? (g_pairingWindowUntilMs - nowMs)
              : 0U;
      Serial.print(pairRemaining);
      Serial.print(" reports=");
      Serial.print(g_device.reportingConfigurationCount());
      Serial.print("\r\n");
    }
  }
}

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(300);
  Serial.print("\r\nbtn_setup stage=serial\r\n");
  Serial.flush();

