lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/LowPower/ZigbeeSleepyOnOffButton/ZigbeeSleepyOnOffButton.ino
  g_bootMs = millis();
  g_bootReportsPending = true;
  g_pendingButtonAction = false;
  g_pairingWindowUntilMs = 0U;
  g_awakeUntilMs = millis() +
                   static_cast<uint32_t>(
                       NRF54L15_CLEAN_ZIGBEE_BOOT_AWAKE_WINDOW_MS);

  if (g_localIeee == 0U) {
    g_localIeee = zigbeeFactoryEui64();
  }

  Gpio::configure(kPinUserLed, GpioDirection::kOutput, GpioPull::kDisabled);
  Gpio::write(kPinUserLed, true);
  Gpio::configure(kPinUserButton, GpioDirection::kInput, GpioPull::kDisabled);

  const uint32_t resetReason = NRF_RESET->RESETREAS;
  NRF_RESET->RESETREAS = resetReason;
  const uint8_t gpregret0 = readGpregret0();
  writeGpregret0(0U);
  g_wokeFromButton =
      ((resetReason & RESET_RESETREAS_OFF_Msk) != 0U) &&
      gpregret0 == kSystemOffMagic;
  Serial.print("btn_setup stage=reset woke=");
  Serial.print(g_wokeFromButton ? "yes" : "no");
  Serial.print("\r\n");
  Serial.flush();

  const bool storeOpen = g_store.begin("zbjoints");
  Serial.print("btn_setup stage=store\r\n");
  Serial.flush();
  restoreState();
  if (!storeOpen) {
    g_persistentSecurityReady = false;
  }
  Serial.print("btn_setup stage=restore joined=");
  Serial.print(g_joined ? "yes" : "no");
  Serial.print("\r\n");
  Serial.flush();

  g_radioReady =
      g_persistentSecurityReady && g_radio.begin(g_channel, 8);
  const bool ok = g_radioReady;
  if (!g_persistentSecurityReady) {
    Serial.print("persistence journal blocked; use c to clear\r\n");
  }
  Serial.print("btn_setup stage=radio ok=");
  Serial.print(ok ? "yes" : "no");
  Serial.print("\r\n");
  Serial.flush();
  Serial.print("\r\nZigbeeSleepyOnOffButton start\r\n");
  Serial.print("radio=");
  Serial.print(ok ? "OK" : "FAIL");
  Serial.print(" preferred_channel=");
  Serial.print(kPreferredChannel);
  Serial.print(" ieee=0x");
  Serial.print(static_cast<uint32_t>(kIeeeAddress >> 32U), HEX);
  Serial.print(static_cast<uint32_t>(kIeeeAddress & 0xFFFFFFFFUL), HEX);
  Serial.print(" joined=");
  Serial.print(g_joined ? "yes" : "no");
  Serial.print(" woke_button=");
  Serial.print(g_wokeFromButton ? "yes" : "no");
  Serial.print("\r\n");
  Serial.print("serial commands: r=report s=status t=toggle o=on f=off j=pair b=scan y=listen c=clear p=factory_reset_pair\r\n");

  if (g_radioReady && g_joined) {
    g_radio.setChannel(g_channel);
  }

  if (g_persistentSecurityReady && g_radioReady && g_wokeFromButton) {
    delay(static_cast<unsigned long>(
        NRF54L15_CLEAN_ZIGBEE_BUTTON_DEBOUNCE_MS));
    const uint32_t heldMs = measureButtonHoldMs(static_cast<uint32_t>(
        NRF54L15_CLEAN_ZIGBEE_BUTTON_PAIR_HOLD_MS));
    if (heldMs >=
        static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_BUTTON_PAIR_HOLD_MS)) {
      beginPairingWindow(g_joined);
      Serial.print("button_hold pairing held_ms=");
      Serial.print(heldMs);
      Serial.print("\r\n");
    } else if (g_joined) {
      g_pendingButtonAction = true;
      extendAwakeWindow(static_cast<uint32_t>(
          NRF54L15_CLEAN_ZIGBEE_ACTION_AWAKE_WINDOW_MS));
      Serial.print("button_press short held_ms=");
      Serial.print(heldMs);
      Serial.print("\r\n");
    } else {
      Serial.print("button_press ignored_not_joined held_ms=");
      Serial.print(heldMs);
      Serial.print(" hold_3s_to_pair\r\n");
    }
  }
}

void loop() {
  handleSerialCommands();
  if (!g_persistentSecurityReady || !g_radioReady) {
    delay(10);
    return;
  }

  const uint32_t now = millis();
  const ZigbeeCommissioningAction action =
      ZigbeeCommissioning::nextAction(&g_network, now);
  if (!g_joined) {
    clearPendingApsAck();
    clearRecentInboundAps();
    const bool pairingActive =
        static_cast<int32_t>(g_pairingWindowUntilMs - now) > 0 ||
        g_rejoinPending ||
        action != ZigbeeCommissioningAction::kNone;
    if (!pairingActive) {
      applyJoinLed();
      maybeEnterLowPowerCycle(now);
      delay(1);
      return;
    }
    if (action == ZigbeeCommissioningAction::kPollParent &&
        (now - g_lastPollMs) >= 250U) {
      g_lastPollMs = now;
      pollCoordinator();
    } else if (action == ZigbeeCommissioningAction::kSecureRejoin) {
      Serial.print("secure_rejoin start\r\n");
      if (performSecureRejoin()) {
        Serial.print("secure_rejoin OK ch=");
      } else {
        Serial.print("secure_rejoin MISS failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
        delay(1);
        return;
      }
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print("\r\n");
      g_pairingWindowUntilMs = 0U;
    } else if (action == ZigbeeCommissioningAction::kJoin) {
      Serial.print("scan_join start\r\n");
      if (!performJoin()) {
        Serial.print("join MISS failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
        delay(1);
        return;
      }
      Serial.print("join OK ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print("\r\n");
      g_pairingWindowUntilMs = 0U;
    }
    applyJoinLed();
    delay(1);
    return;
  }

  if (action == ZigbeeCommissioningAction::kRequestEndDeviceTimeout &&
      !inInterviewGracePeriod(now)) {
    const bool ok = sendEndDeviceTimeoutRequest();
    Serial.print("end_device_timeout_req ");
    Serial.print(ok ? "OK" : "FAIL");
    Serial.print("\r\n");
  } else if (action == ZigbeeCommissioningAction::kSendDeviceAnnounce) {
    const bool ok = sendDeviceAnnounce();
    Serial.print("device_announce ");
    Serial.print(ok ? "OK" : "FAIL");
    Serial.print("\r\n");
  }

  if ((now - g_lastPollMs) >= g_parentPollIntervalMs) {
    g_lastPollMs = now;
    pollCoordinator();
  }
  if ((now - g_bootMs) >= 2000UL) {
    sampleSensors();
  }
  if (g_pendingButtonAction) {
    g_pendingButtonAction = false;
    (void)triggerButtonAction(kOnOffCommandToggle);
  }
  maybeExpirePendingApsAck(now);
  maybeSendScheduledReports(now);
  maybeSendBootReports(now);
  applyJoinLed();

  if ((now - g_lastStatusMs) >=
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_STATUS_INTERVAL_MS)) {
    g_lastStatusMs = now;
    Serial.print("alive ch=");
    Serial.print(g_channel);
    Serial.print(" pan=0x");
    Serial.print(g_panId, HEX);
    Serial.print(" short=0x");
    Serial.print(g_localShort, HEX);
    Serial.print(" nwk_seq=");
    Serial.print(g_haveActiveNetworkKey ? g_activeNetworkKeySequence : 0U);
    Serial.print(" poll_ms=");
    Serial.print(g_parentPollIntervalMs);
    Serial.print(" onoff=");
    Serial.print(g_device.onOff() ? "on" : "off");
    Serial.print(" reports=");
    Serial.print(g_device.reportingConfigurationCount());
    Serial.print("\r\n");
  }

  maybeEnterLowPowerCycle(now);

  delay(1);
}
